package day0803;
//자바의 정석 230p~

public class S01
{
	public static void main(String[] args)
	{
		//객체지향언어
		
		//1. 클래스와 객체의 개념
		
		//1)
		// 클래스 : 건물을 지을때 제일 먼저로 필요로 하는 설계도면 (현관 위치, 복도크기 등 정확하게 디자인된 설계도 면으로ㅗ 건물을 지섹됨.)
		// 객체(object) : 완성된 건물
		
		//2)클래스의 구조와 정의
		//  클래스 명          -> 클래스 헤더
		// --------------
		//  변수 , 상수 (속성)  -> 멤버 필드
		// --------------
		//  생성자
		// --------------
		//  메서드 (동작)      -> 멤버 메서드
		// --------------
		
//		Scanner sc = new Scanner(System.in);
	  // 객체명  변수        생성자함수
		
		
		
		// 클래스
		// 추상적으로 사물의 속성과 움직임을 표현한 것.
		
	}
}
